'''
[PGS] 모스부호 (1)/01/오슬기

입력받은 문자열을 공백을 기준으로 리스트로 만든 뒤
morse 딕셔너리에 key로 대입한 값 추가

'''

def solution(letter):
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    leter_list = list(letter.split())

    answer = ''
    for i in leter_list:
        answer += morse[i]
    return answer